let text = document.getElementById("text");

let buttonOne = document.getElementById("one");
let buttonTwo = document.getElementById("two");
let buttonThree = document.getElementById("three");
let buttonFour = document.getElementById("four");

function chngTxt1() {
    buttonOne.classList.add("otherclass");

    text.innerHTML = "ამ პერიოდის ნაწარმოებებში გამოყენებულია ტრადიციული მუსიკალური ფორმები (concerto grosso, ფუგა და სიმფონია) და ეყრდნობა ადრინდელ სტილებს, განსაკუთრებით, XVIII საუკუნიდან. 1950-იან წლებში დაიწყო სერიული პროცედურების გამოყენება. მისი კომპოზიციები ამ პერიოდიდან, ადრინდელი ნიმუშების მსგავსად, ხასიათდება რიტმული ენერგიით, ხანგრძლივი მელოდიური მასალა აგებულია მცირე, ორ ან სამ ნოტიანი უჯრედისგან, ხოლო ნაწარმოებების ფორმა და ინსტრუმენტული არანჟირება ნათელი და გასაგებია."   
}


function chngTxt2() {
    buttonTwo.onclick.classList.add("otherclass");

    text.innerHTML = "სტრავინსკის საკომპოზიტორო კარიერა გამოირჩევა სტილისტური მრავალფეროვნებით. მან საერთაშორისო აღიარება პირველად მოიპოვა სამი ბალეტით, რომელიც იმპრესარიო სერგეი დიაგილევმა შეუკვეთა და პირველად შესრულდა პარიზში დიაგილევის „რუსული ბალეტის“ (Ballets Russes) მიერ: „ფასკუნჯი“ (L'Oiseau de feu, 1910), „პეტრუშკა“ (1911) და „კურთხეული გაზაფხული“ (Le Sacre du printemps, 1913). ამ უკანასკნელმა გარდაქმნა მომდევნო თაობის კომპოზიტორთა წარმოდგენა რიტმულ სტრუქტურებზე და მეტწილად,"   
}

function chngTxt3() {
    buttonThree.classList.add("otherclass");

    text.innerHTML = "სტრავინსკი დაიბადა 1882 წლის 17 ივნისს, ორანიენბაუმში, ახლანდელ ლომონოსოვის რაიონში, რუსეთის იმპერიის დედაქალაქის, სანქტ-პეტერბურგის გარეუბანში[18] და აღიზარდა სანქტ-პეტერბურგში.[19] მისი მშობლები იყვნენ ფიოდორ სტრავინსკი (1843–1902), ცნობილი ბანი კიევის ოპერასა და სანქტ-პეტერბურგის მარინის თეატრში და ანა (დაბ. ხოლოდოვსკი, 1854–1939), წარმოშობით კიევიდან, ერთ-ერთი კიევის ქონების სამინისტროს მაღალჩინოსნის ოთხი ქალიშვილიდან. ფიოდორი იყო „პოლონელი"   
}


function chngTxt4() {
    buttonFour.classList.add("otherclass");

    text.innerHTML = "ასევე, მოამზადა ალექსანდრე გლაზუნოვის სიმებიანი კვარტეტის საფორტეპიანო ტრანსკრიპცია. გადმოცემით, გლაზუნოვს სტრავინსკი არამუსიკალურად მიაჩნდა და მის შესაძლებლობებზე დაბალი წარმოდგენისა იყო.[23]"   
}